{"cho-1": "Cho Chikun's Encyclopedia of Life & Death : Part 1 --- Elementary\n\nThis is a collection of almost three thousand problems from Encyclopedia of Life and Death by Cho Chikun. The problems come without solutions for two reasons: first, one can learn more by reading out all the paths and solving the problems oneself; second, the solutions are copyrighted. All the problems are black to move.\nIn this first part, you'll find about nine hundred problems for beginners. A dan player should find the solution in a few seconds and will need about an hour solve the whole book.\nI wish you enjoyment and improvement in the wonderful game of go, weiqi, baduk, or whatever you like to call it.\n - Vit Brunner\n", "cho-2": "Cho Chikun's Encyclopedia of Life & Death : Part 2 --- Intermediate\n\nThis is a collection of almost three thousand problems from Encyclopedia of Life and Death by Cho Chikun. The problems come without solutions for two reasons: first, one can learn more by reading out all the paths and solving the problems oneself; second, the solutions are copyrighted. All the problems are black to move.\nIn the second part, you can find about nine hundred problems aimed at strong kyu players. A dan player should find the solution in less than a minute and will need about ten hours to solve the whole book.\nI wish you enjoyment and improvement in the wonderful game of go, weiqi, baduk, or whatever you like to call it.\n - Vit Brunner\n", "cho-3": "Cho Chikun's Encyclopedia of Life & Death : Part 2 --- Advanced\n\nThis is a collection of almost three thousand problems from Encyclopedia of Life and Death by Cho Chikun. The problems come without solutions for two reasons: first, one can learn more by reading out all the paths and solving the problems oneself; second, the solutions are copyrighted. All the problems are black to move.\nIn the third part, you can find about eight hundred problems aimed at advanced players. A dan player should find the solution in a few minutes and will need about 100 hours to solve the whole book.\nI wish you enjoyment and improvement in the wonderful game of go, weiqi, baduk, or whatever you like to call it.\n - Vit Brunner\n", "gokyoshumyo": "Gokyo Shumyo\n\nGokyo Shumyo is a classical problem collection published by Hayashi Genbi in 1822. Its name could be translated to English as \"Brilliances from go classics\". \nThe collection consists of 520 problems, which are divided into the following seven sections:\n1. Living (103 problems)\n2. Killing (71 problems)\n3. Creating a ko (90 problems)\n4. Capturing races (96 problems)\n5. Oiotoshi (40 problems)\n6. Connecting (74 problems)\n7. Various techniques (46 problems)\n\nI wish you to enjoy and improve while studying these problems,\n - Vit Brunner\n", "lee-chang-ho": "Lee Chang-ho's Selected Life and Death Go Problems\n\nThis is a collection of 727 problems from Lee Chang-ho's Selected Life and Death Go Problems, originally published as a six-volume series. The problems become more difficult as one proceeds through the volumes. All the problems are black to move.\nEnjoy solving the problems and developing your reading skills.\n - Vit Brunner\n", "hatsuyoron": "Igo Hatsuyo-ron\n\nThe notoriously difficult Igo Hatsuyo-ron was compiled around 1710 by Inoue Dosetsu Inseki, fourth head of the Inoue house and fifth Meijin Godokoro. It was designed for training of the best students of the Inoue school and was kept secret for a long time.\nIgo Hatsuyo-ron consists of 183 mostly insanely difficult problems and is aimed at serious players with deep interest in the game. While solving the problems takes many months, possibly even years, finding the solution is always particularly rewarding.\nI wish you enjoyment and improvement in the wonderful game of go, weiqi, baduk, or whatever you like to call it.\n - Vit Brunner\n", "xxqj": "Xuanxuan Qijing (Gengen Gokyo)\n\n\"Gateway to All Marvels\" - Xuanxuan Qijing is a classical Chinese collection compiled by Yan Defu and Yan Tianzhang around year 1347. Its perhaps more popular Japanese name is Gengen Gokyo.\nThere circulate many versions of the collection. This should be one of the more complete versions, containing 347 problems of a fairly difficult level. Unless you are a top amateur player, some of the problems might be difficult for you. However, if you keep solving the problems, you will improve your reading immensely.\nEnjoy solving the problems and improving your reading.\n - Vit Brunner\n"}